In [9]:
# Importamos bibliotecas
import pandas as pd
import duckdb as dd

# principal

In [10]:

#%%===========================================================================
# Importamos los datasets que vamos a utilizar en este programa
#=============================================================================

carpeta = ""

# Ejercicios AR-PROJECT, SELECT, RENAME
empleado       = pd.read_csv(carpeta+"empleado.csv")
# Ejercicios AR-UNION, INTERSECTION, MINUS
alumnosBD      = pd.read_csv(carpeta+"alumnosBD.csv")
alumnosTLeng   = pd.read_csv(carpeta+"alumnosTLeng.csv")
# Ejercicios AR-CROSSJOIN
persona        = pd.read_csv(carpeta+"persona.csv")
nacionalidades = pd.read_csv(carpeta+"nacionalidades.csv")
# Ejercicios ¿Mismos Nombres?
se_inscribe_en=pd.read_csv(carpeta+"se_inscribe_en.csv")
materia       =pd.read_csv(carpeta+"materia.csv")
# Ejercicio JOIN múltiples tablas
vuelo      = pd.read_csv(carpeta+"vuelo.csv")    
aeropuerto = pd.read_csv(carpeta+"aeropuerto.csv")    
pasajero   = pd.read_csv(carpeta+"pasajero.csv")    
reserva    = pd.read_csv(carpeta+"reserva.csv")    
# Ejercicio JOIN tuplas espúreas
empleadoRol= pd.read_csv(carpeta+"empleadoRol.csv")    
rolProyecto= pd.read_csv(carpeta+"rolProyecto.csv")    
# Ejercicios funciones de agregación, LIKE, Elección, Subqueries 
# y variables de Python
examen     = pd.read_csv(carpeta+"examen.csv")
# Ejercicios de manejo de valores NULL
examen03 = pd.read_csv(carpeta+"examen03.csv")

In [11]:
print(empleado)

consultaSQL = """
               SELECT DISTINCT DNI, Salario
               FROM empleado;
              """

dataframeResultado = dd.sql(consultaSQL).df()

print(dataframeResultado)

        DNI  Nombre Sexo  Salario
0  20222333   Diego    M  20000.0
1  33456234   Laura    F  25000.0
2  45432345  Marina    F  10000.0
        DNI  Salario
0  45432345  10000.0
1  20222333  20000.0
2  33456234  25000.0

In [12]:
#%%===========================================================================
# Ejercicios AR-PROJECT <-> SELECT
#=============================================================================
# a.- Listar DNI y Salario de empleados 
consultaSQL = """
               SELECT DISTINCT DNI, Salario
               FROM empleado;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)
#%%-----------
# b.- Listar Sexo de empleados 
consultaSQL = """
               SELECT DISTINCT Sexo
               FROM empleado;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print("ej2:", r"/n",dataframeResultado)
#%%-----------
#c.- Listar Sexo de empleados (sin DISTINCT)
consultaSQL = """
               SELECT Sexo
               FROM empleado;
              """

dataframeResultado = dd.sql(consultaSQL).df()

print(dataframeResultado)

        DNI  Salario
0  20222333  20000.0
1  33456234  25000.0
2  45432345  10000.0
ej2: /n   Sexo
0    M
1    F
  Sexo
0    M
1    F
2    F

In [13]:


#%%===========================================================================
# Ejercicios AR-SELECT <-> WHERE
#=============================================================================
# a.- Listar de EMPLEADO sólo aquellos cuyo sexo es femenino
consultaSQL = """
                SELECT DISTINCT *
                FROM empleado
                WHERE Sexo = 'F';
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

        DNI  Nombre Sexo  Salario
0  45432345  Marina    F  10000.0
1  33456234   Laura    F  25000.0

In [14]:
#%% -----------
#b.- Listar de EMPLEADO aquellos cuyo sexo es femenino y su salario es mayor a $15.000
consultaSQL = """
            SELECT DISTINCT *
            FROM empleado
            WHERE Sexo = 'F' and Salario > '15000';
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

        DNI Nombre Sexo  Salario
0  33456234  Laura    F  25000.0

In [15]:
#%%===========================================================================
# Ejercicios AR-RENAME <-> AS
#=============================================================================
#a.- Listar DNI y Salario de EMPLEADO, y renombrarlos como id e Ingreso
consultaSQL = """
            SELECT DISTINCT *
            FROM empleado
            WHERE 
              """

dataframeResultado = dd.sql(consultaSQL).df()


#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    INICIO -->           EJERCICIO Nro. 01                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# IMPORTANTE: Recordar que se utilizaran los datos de vuelo, aeropuerto, pasajero y reserva

ParserException: Parser Error: syntax error at end of input

In [ ]:
#%%===========================================================================
# EJERCICIOS PARA REALIZAR DE MANERA INDIVIDUAL --> EJERCICIO Nro. 01
#=============================================================================
# Ejercicio 01.1.- Retornar Codigo y Nombre de los aeropuertos de Londres
consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()

#%% -----------
# Ejercicio 01.2.- ¿Qué retorna 
#                       SELECT DISTINCT Ciudad AS City 
#                       FROM aeropuerto 
#                       WHERE Codigo='ORY' OR Codigo='CDG'; ?
consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()

#%% -----------
# Ejercicio 01.3.- Obtener los números de vuelo que van desde CDG hacia LHR
consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()

#%% -----------
# Ejercicio 01.4.- Obtener los números de vuelo que van desde CDG hacia LHR o viceversa
consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()

#%% -----------
# Ejercicio 01.5.- Devolver las fechas de reservas cuyos precios son mayores a $200
consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()

In [ ]:

#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    FIN -->              EJERCICIO Nro. 01                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
    
#=============================================================================
# Ejercicios AR-UNION, INTERSECTION, MINUS <-> UNION, INTERSECTION, EXCEPT
#=============================================================================
# a1.- Listar a los alumnos que cursan BDs o TLENG

consultaSQL = """
            SELECT *
            FROM alumnosBD
            UNION
            SELECT *
            FROM alumnosTLeng
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   ID     Nombre
0   4  Alejandro
1   3     Marina
2   1      Diego
3   2      Laura

In [ ]:

#%% -----------
# a2.- Listar a los alumnos que cursan BDs o TLENG (usando UNION ALL)

consultaSQL = """
            SELECT *
            FROM alumnosBD
            UNION ALL
            SELECT *
            FROM alumnosTLeng
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   ID     Nombre
0   1      Diego
1   2      Laura
2   3     Marina
3   2      Laura
4   4  Alejandro

In [ ]:
#%% -----------
# b.- Listar a los alumnos que cursan simultáneamente BDs y TLENG

consultaSQL = """
            SELECT *
            FROM alumnosBD
            INTERSECT
            SELECT *
            FROM alumnosTLeng;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   ID Nombre
0   2  Laura

In [ ]:



#%% -----------
# c.- Listar a los alumnos que cursan BDs y no cursan TLENG 

consultaSQL = """
            SELECT *
            FROM alumnosBD
            EXCEPT
            SELECT *
            FROM alumnosTLeng
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   ID  Nombre
0   3  Marina
1   1   Diego

In [ ]:

#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    INICIO -->           EJERCICIO Nro. 02                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# IMPORTANTE: Recordar que se utilizaran los datos de vuelo, aeropuerto, pasajero y reserva

#=============================================================================
#  EJERCICIOS PARA REALIZAR DE MANERA INDIVIDUAL --> EJERCICIO Nro. 02
#=============================================================================
# Ejercicio 02.1.- Devolver los números de vuelo que tienen reservas generadas (utilizar intersección)
consultaSQL = """
            SELECT Numero
            FROM vuelo
            INTERSECT
            SELECT NroVuelo
            FROM reserva
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Numero
0     321
1     345
2     165

In [ ]:

#%%-----------
# Ejercicio 02.2.- Devolver los números de vuelo que aún no tienen reservas
consultaSQL = """
            SELECT Numero
            FROM vuelo
            EXCEPT
            SELECT NroVuelo
            FROM reserva
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Numero
0     903
1     447

In [ ]:
#%%-----------
# Ejercicio 02.3.- Retornar los códigos de aeropuerto de los que parten o arriban los vuelos
consultaSQL = """
            SELECT Origen            FROM vuelo            INTERSECT            SELECT Codigo            FROM aeropuerto
              """
              
dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

  Origen
0    MAD
1    LHR
2    CDG

In [ ]:

#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    FIN -->              EJERCICIO Nro. 02                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

#=============================================================================
# Ejercicios AR-... JOIN <-> ... JOIN
#=============================================================================
# a1.- Listar el producto cartesiano entre las tablas persona y nacionalidades

consultaSQL = """
            SELECT DISTINCT *
            FROM persona
            CROSS JOIN nacionalidades
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Nombre Nacionalidad IDN    Detalle
0   Diego           AR  AR   Agentina
1  Marina           AR  BR  Brasilera
2  Marina           AR  CH    Chilena
3  Marina           AR  AR   Agentina
4   Diego           AR  BR  Brasilera
5   Laura           BR  BR  Brasilera
6   Diego           AR  CH    Chilena
7   Laura           BR  AR   Agentina
8   Laura           BR  CH    Chilena

In [ ]:

#%%-----------
# a2.- Listar el producto cartesiano entre las tablas persona y nacionalidades (sin usar CROSS JOIN)

consultaSQL = """
            SELECT DISTINCT *
            FROM persona , nacionalidades
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Nombre Nacionalidad IDN    Detalle
0   Laura           BR  AR   Agentina
1   Laura           BR  CH    Chilena
2  Marina           AR  AR   Agentina
3   Diego           AR  AR   Agentina
4  Marina           AR  BR  Brasilera
5  Marina           AR  CH    Chilena
6   Diego           AR  BR  Brasilera
7   Laura           BR  BR  Brasilera
8   Diego           AR  CH    Chilena

In [ ]:

#%% --------------------------------------------------------------------------------------------
# Carga los nuevos datos del dataframe persona para los ejercicios de AR-INNER y LEFT OUTER JOIN
# ----------------------------------------------------------------------------------------------
persona        = pd.read_csv(carpeta+"persona_ejemplosJoin.csv")
# ----------------------------------------------------------------------------------------------
# b1.- Vincular las tablas persona y nacionalidades a través de un INNER JOIN

consultaSQL = """
            SELECT *
            FROM persona
            INNER JOIN nacionalidades
                ON persona.Nacionalidad = nacionalidades.IDN;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Unnamed: 0  Nombre Nacionalidad IDN    Detalle
0           0   Diego           BR  BR  Brasilera
1           2  Marina           AR  AR   Agentina

In [ ]:

#%%-----------
# b2.- Vincular las tablas persona y nacionalidades (sin usar INNER JOIN)

consultaSQL = """
            SELECT *
            FROM persona
            LEFT JOIN nacionalidades
                ON persona.Nacionalidad = nacionalidades.IDN;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Unnamed: 0    Nombre Nacionalidad   IDN    Detalle
0           0     Diego           BR    BR  Brasilera
1           2    Marina           AR    AR   Agentina
2           1     Laura         None  None       None
3           3  Santiago           UY  None       None

In [ ]:

#%%-----------
# c.- Vincular las tablas persona y nacionalidades a través de un LEFT OUTER JOIN
consultaSQL = """
            SELECT *
            FROM persona
            LEFT OUTER JOIN nacionalidades
                ON persona.Nacionalidad = nacionalidades.IDN;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Unnamed: 0    Nombre Nacionalidad   IDN    Detalle
0           0     Diego           BR    BR  Brasilera
1           2    Marina           AR    AR   Agentina
2           1     Laura         None  None       None
3           3  Santiago           UY  None       None

In [ ]:

#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    INICIO -->           EJERCICIO Nro. 03                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# IMPORTANTE: Recordar que se utilizaran los datos de vuelo, aeropuerto, pasajero y reserva

#%%===========================================================================
# EJERCICIOS PARA REALIZAR DE MANERA INDIVIDUAL --> EJERCICIO Nro. 03
#=============================================================================
# Ejercicio 03.1.- Devolver el nombre de la ciudad de partida del vuelo número 165

consultaSQL = """
            SELECT Ciudad
            FROM aeropuerto
            INNER JOIN vuelo
             ON Codigo = Origen
             WHERE Numero =  165 
                

              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

    Ciudad
0  Londres

In [ ]:

#%%-----------
# Ejercicio 03.2.- Retornar el nombre de las personas que realizaron reservas a un valor menor a $200

consultaSQL = """
            SELECT Nombre
            FROM pasajero
            INNER JOIN reserva
                ON reserva.DNI =  pasajero.DNI
            WHERE Precio < 200

              """
dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

  Nombre
0  Maria
1  Pedro

In [ ]:

#%%-----------
# Ejercicio 03.3.- Obtener Nombre, Fecha y Destino del Viaje de todos los pasajeros que vuelan desde Madrid

vuelosAMadrid = dd.sql("""
            SELECT *
            FROM vuelo
            INNER JOIN aeropuerto
               ON Codigo = Origen
            WHERE Ciudad = 'Madrid'
              """).df()

print(vuelosAMadrid)

   Numero Origen Destino Salida Codigo   Nombre  Ciudad
0     345    MAD     CDG  12:30    MAD  Barajas  Madrid
1     321    MAD     ORY  19:05    MAD  Barajas  Madrid

In [ ]:

dniPersonasDesdeMadrid = dd.sql("""
            SELECT *
            FROM pasajero
            INNER JOIN reserva
                ON reserva.DNI =  pasajero.DNI
                                

              """).df()
print(dniPersonasDesdeMadrid)

   DNI  Nombre  DNI_1  NroVuelo     Fecha  Precio
0  789  Isabel    789       165  07-01-11   210.0
1  123   Maria    123       345  20-12-10   170.0
2  789  Isabel    789       321  15-12-10   250.0
3  456   Pedro    456       345  03-11-10   190.0

In [ ]:

consultaSQL = """
            SELECT  dniPersonasDesdeMadrid.Nombre, Fecha, Destino
            FROM dniPersonasDesdeMadrid INNER JOIN vuelosAMadrid ON NroVuelo = Numero
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   Nombre     Fecha Destino
0   Maria  20-12-10     CDG
1  Isabel  15-12-10     ORY
2   Pedro  03-11-10     CDG

In [ ]:
#%% # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # #                                                                     # #
# #    FIN -->              EJERCICIO Nro. 03                             # #
 # #                                                                     # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
 # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

    
#%%===========================================================================
# Ejercicios SQL - Join de varias tablas en simultáneo
#=============================================================================
# a.- Vincular las tablas Reserva, Pasajero y Vuelo. Mostrar sólo Fecha de reserva, hora de salida del vuelo y nombre de pasajero.
    
consultaSQL = """
            SELECT Fecha, Salida, pasajero.Nombre
            FROM reserva INNER JOIN pasajero ON reserva.DNI =  pasajero.DNI 
            INNER JOIN vuelo ON reserva.NroVuelo = vuelo.Numero
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

      Fecha Salida  Nombre
0  03-11-10  12:30   Pedro
1  15-12-10  19:05  Isabel
2  07-01-11  09:55  Isabel
3  20-12-10  12:30   Maria

In [ ]:

    
#%%===========================================================================
# Ejercicios SQL - Tuplas espúreas
#=============================================================================
# a.- Vincular (JOIN)  EmpleadoRol y RolProyecto para obtener la tabla original EmpleadoRolProyecto
    
consultaSQL = """
            SELECT *
            FROM empleadoRol , rolProyecto WHERE empleadoRol.rol =  rolProyecto.rol
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

  empleado            rol          rol_1 proyecto
0      Ana    Diseñador/a    Diseñador/a      BNA
1      Ana  Programador/a  Programador/a      BNA
2    Bruno    Diseñador/a    Diseñador/a      BNA
3      Ana    Diseñador/a    Diseñador/a      YPF
4    Bruno    Diseñador/a    Diseñador/a      YPF

In [18]:

#%%===========================================================================
# Ejercicios SQL - Funciones de agregación
#=============================================================================
# a.- Usando sólo SELECT contar cuántos exámenes fueron rendidos (en total)
    
consultaSQL = """
            SELECT count(*) AS cantidadExamenes
            FROM examen
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

   cantidadExamenes
0                16

In [72]:
#%%-----------
# b1.- Usando sólo SELECT contar cuántos exámenes fueron rendidos en cada Instancia
columna = 'Instancia'
consultaSQL = f"""
            SELECT {columna},count(*) AS Examenes
            FROM examen
            GROUP BY {columna}
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

          Instancia  Examenes
0        Parcial-01         6
1        Parcial-02         5
2  Recuperatorio-01         3
3  Recuperatorio-02         2

In [87]:

#%%-----------
# b2.- Usando sólo SELECT contar cuántos exámenes fueron rendidos en cada Instancia (ordenado por instancia)
    
consultaSQL = """
            SELECT Instancia, count(*) AS Asistieron
            FROM examen GROUP BY Instancia 
            ORDER BY Instancia ASC;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

          Instancia  Asistieron
0        Parcial-01           6
1        Parcial-02           5
2  Recuperatorio-01           3
3  Recuperatorio-02           2

In [91]:

#%%-----------
# b3.- Ídem ejercicio anterior, pero mostrar sólo las instancias a las que asistieron menos de 4 Estudiantes
    
consultaSQL = """
            SELECT Instancia, count(*) AS Asistieron
            FROM examen GROUP BY Instancia 
            HAVING Asistieron < 4
            ORDER BY Instancia ASC;
              """

dataframeResultado = dd.sql(consultaSQL).df()
print(dataframeResultado)

          Instancia  Asistieron
0  Recuperatorio-01           3
1  Recuperatorio-02           2

In [93]:

#%%-----------
# c.- Mostrar el promedio de edad de los estudiantes en cada instancia de examen
    
consultaSQL = """
            SELECT Instancia, AVG(Edad) AS EdadPromedio
            FROM examen GROUP BY Instancia 
            ORDER BY Instancia ASC;
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

          Instancia  EdadPromedio
0        Parcial-01     21.833333
1        Parcial-02     21.800000
2  Recuperatorio-01     19.666667
3  Recuperatorio-02     21.000000

In [ ]:

#%%===========================================================================
# Ejercicios SQL - LIKE")
#=============================================================================
# a1.- Mostrar cuál fue el promedio de notas en cada instancia de examen, sólo para instancias de parcial.
    
consultaSQL = """
            SELECT Instancia, AVG(Nota) AS NotaPromedio
            FROM examen GROUP BY Instancia 
            HAVING instancia='Parcial-01' OR instancia='Parcial-02'
            ORDER BY Instancia ASC
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

    Instancia  NotaPromedio
0  Parcial-01      5.166667
1  Parcial-02      6.800000

In [104]:
#%%-----------
# a2.- Mostrar cuál fue el promedio de notas en cada instancia de examen, sólo para instancias de parcial. Esta vez usando LIKE.
    
consultaSQL = """
            SELECT Instancia, AVG(Nota) AS NotaPromedio
            FROM examen GROUP BY Instancia 
            HAVING instancia LIKE'P%'
            ORDER BY Instancia ASC
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

    Instancia  NotaPromedio
0  Parcial-01      5.166667
1  Parcial-02      6.800000

In [ ]:


#%%-----------
# a2.- Modificar la consulta anterior para que informe cuántos estudiantes aprobaron/reprobaron en cada instancia.
    
consultaSQL = """
                SELECT INSTANCIA,
                    CASE WHEN Nota>=4
                      THEN 'APROBÓ'
                      ELSE 'NO APROBÓ'
                    END AS Estado,
                  
                count(*) AS Cantidad
                    
                FROM examen
                GROUP BY Instancia,Estado
                HAVING Instancia= 'Parcial-01'
                
                ORDER BY Instancia,Estado
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

    Instancia     Estado  Cantidad
0  Parcial-01     APROBÓ         3
1  Parcial-01  NO APROBÓ         3

In [140]:

#%%===========================================================================
# Ejercicios SQL - Subqueries
#=============================================================================
#a.- Listar los alumnos que en cada instancia obtuvieron una nota mayor al promedio de dicha instancia

consultaSQL = """
                SELECT INSTANCIA, 
                CASE NOTA >= AVG(Nota)
                    THEN 'NOMBRE'
                FROM examen
                GROUP BY Instancia
              """

dataframeResultado = dd.sql(consultaSQL).df()
dataframeResultado

ParserException: Parser Error: syntax error at or near "THEN"

LINE 4:                     THEN 'NOMBRE'
                            ^

In [ ]:



#%%-----------
# b.- Listar los alumnos que en cada instancia obtuvieron la mayor nota de dicha instancia

consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()


#%%-----------
# c.- Listar el nombre, instancia y nota sólo de los estudiantes que no rindieron ningún Recuperatorio

consultaSQL = """

              """

dataframeResultado = dd.sql(consultaSQL).df()